Terraform PLAN for base_config:

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ssm_parameter.common_sensitive["/bfd/mgmt/common/sensitive/alarm_ec2_instance_script_failing_start_runbook_url"] will be created
  + resource "aws_ssm_parameter" "common_sensitive" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = "arn:aws:kms:us-east-1:577373831711:key/mrk-988de2365a354883bf8b253f885e0153"
      + name           = "/bfd/mgmt/common/sensitive/alarm_ec2_instance_script_failing_start_runbook_url"
      + overwrite      = true
      + tags_all       = {
          + "Environment"    = "mgmt"
          + "Terraform"      = "true"
          + "application"    = "bfd"
          + "business"       = "oeda"
          + "stack"          = "mgmt"
          + "tf_module_root" = "ops/terraform/env/mgmt/base_config"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.